{
  "header": {
    "home": "Início",
    "projects": "Projetos",
    "methodology": "Metodologia",
    "about": "Sobre mim",
    "contact": "Contato",
    "toggle-dark-light-mode-tooltip": "Alterar modo escuro/claro"
  },
  "main_sentence": {
    "title": "Impulsionando o mundo digital através dos bastidores",
    "description": "Eu construo infraestruturas de backend escaláveis, seguras e integradas"
  },
  "description": {
    "text": "Eu sou <underline>Vinicius Mayrink</underline> e sou um desenvolvedor de backend especializado em criar APIs robustas usando um arsenal de ferramentas, incluindo <highlight>Python</highlight>, <highlight>Java</highlight> e <highlight>Node.js</highlight>. Com um profundo entendimento dos princípios e conceitos de backend, sou proficiente na implementação dos princípios SOLID, arquitetura RESTful e práticas de código limpo para projetar soluções <strong>escaláveis</strong> e <strong>eficientes</strong>",
    "button": "Veja mais"
  },
  "certificates": {
    "types": {
      "course": "Curso",
      "graduation": "Graduação",
      "technical": "Técnico"
    },
    "technical": {
      "cefet": "CEFET Redes de Computadores (2016-18)"
    },
    "graduation": {
      "puc": "PUC-MG Sistemas de Informação (2021-24)"
    }
  },
  "projects": {
    "title": "Projetos",
    "button-to-github": "Veja no GitHub",
    "fakeapi": {
      "title": "Fake API",
      "description": "Fake API permite configurar e executar rapidamente um servidor RESTful com endpoints e respostas personalizáveis. Isso a torna uma ferramenta ideal para testes de software sem depender de serviços externos"
    },
    "restaurant": {
      "title": "Integração em restaurantes API",
      "description": "Esta API tem como objetivo centralizar informações relacionadas a pedidos de restaurantes em um único lugar, fornecendo webhooks para que outros sistemas possam tomar decisões com base na atividade de pedidos"
    },
    "todayiwill": {
      "title": "todayiwill",
      "description": "Um aplicativo de linha de comando (CLI) construído com Rust e clap que oferece uma solução simples, mas poderosa, para aumentar a produtividade e garantir que você esteja no controle de suas responsabilidades diárias"
    },
    "work-time-calculator": {
      "title": "Calculador de Tempo Trabalhado API",
      "description": "Este é um aplicativo construído com Spring Boot e Gradle para calcular o tempo de trabalho para determinados parâmetros de entrada"
    },
    "sentiment-analysis": {
      "title": "Análise de sentimentos em português",
      "description": "Este projeto tem como objetivo analisar e prever sentimentos associados a textos escritos em língua portuguesa através de NLP (Processamento de Linguagem Natural)"
    },
    "digital-donations": {
      "title": "Doar Digital API",
      "description": "API REST responsável por gerenciar informações de doação. Esta API foi construída com NodeJS e Koa.js. A aplicação espera um banco de dados PostgreSQL. Docker foi utilizado para executar os serviços da aplicação"
    }
  },
  "methodology": {
    "title": "Metodologia",
    "paragraph-1": "Nos meus projetos, eu uso os princípios de <highlight>DevOps</highlight>. DevOps leva a entregas <underline>mais rápidas</underline> e mais <underline>frequentes</underline>, melhorando a capacidade de responder prontamente às mudanças do mercado e às necessidades dos clientes. As pipelines de integração contínua e entrega contínua (CI/CD) simplificam o processo de implantação, reduzindo o tempo de lançamento no mercado.",
    "paragraph-2": "A <underline>integração contínua (CI)</underline> e os testes são automatizados com Jenkins e GitHub Actions. A <underline>entrega contínua (CD)</underline> usa Jenkins e Docker, com Docker Hub para gerenciamento de imagens. A <underline>implantação</underline> é feita no AWS EC2 e Google Cloud Run. Esses estágios integrados e tecnologias permitem uma entrega contínua e eficiente de <highlight>software de alta qualidade</highlight>, aumentando a produtividade e a satisfação do usuário."
  },
  "about": {
    "title": "Sobre mim",
    "position": "Software/Back-end Engineer",
    "actions": {
      "resume-english": "CV (inglês)",
      "resume-portuguese": "CV (português)"
    },
    "paragraph-1": "APIs e Web APIs são <underline>essenciais</underline> para integrações digitais, servindo como o ponto central que possibilita a comunicação e colaboração contínuas entre sistemas e serviços diversos. Essas APIs fornecem interfaces padronizadas que <underline>permitem</underline> que diferentes aplicativos interajam, compartilhem dados e executem funções pela web.",
    "paragraph-2": "Minha paixão é criar essas APIs REST com ferramentas como Python, Node.js, Java e PHP. Essa é a área para o qual me especializo e me desenvolvo a cada dia. Acredito que práticas de <highlight>DevOps</highlight>, <highlight>DevSecOps</highlight>, <highlight>CI/CD</highlight> e <highlight>Frameworks ágeis</highlight> são essenciais para que as aplicações sejam desenvolvidas de forma colaborativa e organizada, reduzindo significativamente problemas e bugs mesmo antes de chegarem aos ambientes de produção",
    "paragraph-3": "Como visto nesta página, também tenho experiência na criação de interfaces web com frameworks JavaScript. Habilidades <highlight>Full-stack</highlight> são importantes para o desenvolvimento de aplicações abrangentes e adequadas.",
    "certifications": {
      "title": "Meu certificados e conquistas"
    }
  },
  "contact": {
    "title": "Entre em contato por"
  },
  "footer": {
    "website-tools": "Este site foi produzido com"
  }
}
