{
  "header": {
    "home": "Home",
    "projects": "Projects",
    "methodology": "Methodology",
    "about": "About me",
    "contact": "Contact",
    "toggle-dark-light-mode-tooltip": "Toogle dark/light mode"
  },
  "main_sentence": {
    "title": "Powering the digital world from behind the scenes",
    "description": "I build scalable, secure, and seamless backend infrastructures"
  },
  "description": {
    "text": "I am <underline>Vinicius Mayrink</underline> and I am a backend developer specialized in crafting robust APIs using an arsenal of tools including <highlight>Python</highlight>, <highlight>Java</highlight>, and <highlight>Node.js</highlight>. With a deep understanding of backend principles and concepts, I am proficient in implementing SOLID principles, RESTful architecture, and clean code practices to engineer <strong>scalable</strong> and <strong>efficient</strong> solutions.",
    "button": "Check it out"
  },
  "certificates": {
    "types": {
      "course": "Course",
      "graduation": "Graduation",
      "technical": "Technical"
    },
    "technical": {
      "cefet": "CEFET Computer Networks (2016-18)"
    },
    "graduation": {
      "puc": "PUC-MG Information Systems (2021-24)"
    }
  },
  "projects": {
    "title": "Projects",
    "button-to-github": "See on GitHub",
    "restaurant": {
      "title": "Restaurant Integration API",
      "description": "This API aims to centralize information related to restaurant orders in just one place, providing webhooks so that other systems can make decisions based on order activity"
    },
    "work-time-calculator": {
      "title": "Work Time Calculator API",
      "description": "This is an app built with Spring Boot and Gradle to calculate work time for a given parameter inputs"
    },
    "sentiment-analysis": {
      "title": "Sentiment Analysis in Portuguese Sentences",
      "description": "This project aims at analyzing and predicting sentiments associated with texts written in the Portuguese language through NLP (Natural Language Processing)"
    },
    "digital-donations": {
      "title": "Digital Donations API",
      "description": "REST API responsible for managing donation information. This API was built with NodeJS and Koa.js. The application expects a PostgreSQL database. Docker was used to run the app services"
    }
  },
  "methodology": {
    "title": "Methodology",
    "paragraph-1": "In my projects, I use <highlight>DevOps</highlight> principles. DevOps leads to <underline>faster</underline> and more <underline>frequent</underline> releases, enhancing the ability to respond to market changes and customer needs promptly. Continuous integration and continuous delivery (CI/CD) pipelines streamline the deployment process, reducing time to market.",
    "paragraph-2": "<underline>Continuous integration (CI)</underline> and testing are automated with Jenkins, GitHub Actions. <underline>Continuous delivery (CD)</underline> uses Jenkins and Docker, with Docker Hub for managing images. <underline>Deployment</underline> is done on AWS EC2 and Google Cloud Run. These integrated stages and technologies enable efficient, continuous delivery of <highlight>high-quality software</highlight>, boosting productivity and user satisfaction."
  },
  "about": {
    "title": "About me",
    "position": "Software/Back-end Engineer",
    "actions": {
      "resume-english": "CV (english)",
      "resume-portuguese": "CV (portuguese)"
    },
    "paragraph-1": "APIs and Web APIs are <underline>indispensable</underline> for digital integrations, serving as the linchpin that enables seamless communication and collaboration between disparate systems and services. These APIs provide standardized interfaces that <underline>allow</underline> different software applications to interact, share data, and execute functions across the web.",
    "paragraph-2": "My passion is creating these REST APIs with tools such as Python, Node.js, Java, and PHP. This is the area in which I specialize and continuously develop myself every day. I believe that <highlight>DevOps</highlight>, <highlight>DevSecOps</highlight>, <highlight>CI/CD</highlight> and <highlight>Agile Frameworks</highlight> practices are essential for applications to be developed collaboratively and in an organized manner, significantly reducing potential problems and bugs even before they reach production environments.",
    "paragraph-3": "As seen on this page, I also have experience in creating web interfaces with JavaScript frameworks. <highlight>Full-stack</highlight> skills are important for developing comprehensive and suitable applications.",
    "certifications": {
      "title": "My certifications and accomplishments"
    }
  },
  "contact": {
    "title": "Contact me on"
  },
  "footer": {
    "website-tools": "This website is powered by"
  }
}
